data_assignment/foam_cases/old_cases/broken_total_BCs_base_case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (63.5 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    Inlet
    {
        type pressureDirectedInletVelocity;
        inletDirection uniform (1 0 0);  // 0 deg
//         inletDirection uniform (0.99452189 0.1045284633 0);  // 6 deg
//         inletDirection uniform (0.9739759673 0.2266513074 0);  // 13.1 deg
        value          uniform (0 0 0);  
    }
    
    
    Outlet
    {
        type zeroGradient;
    }
    
    
    Airfoil
    {
        type noSlip;
    }
    
    Flap
    {
        $Airfoil
    }
    
    Side
    {
        type empty;
    }
}


// ************************************************************************* //
