data_assignment/foam_cases/old_cases/broken_total_BCs_base_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Side
    {
        type            empty;
        physicalType    patch;
        nFaces          22596;
        startFace       22022;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          14;
        startFace       44618;
    }
    Airfoil
    {
        type            wall;
        physicalType    patch;
        nFaces          168;
        startFace       44632;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          112;
        startFace       44800;
    }
    Flap
    {
        type            wall;
        physicalType    patch;
        nFaces          98;
        startFace       44912;
    }
)

// ************************************************************************* //
